{
	"ENG": {
		"aboutMe": "About Me",
		"projects": "Projects",
		"resume": "Resume",
		"resumeFile": "./cv/resume.pdf",
		"takeALook": "TAKE A LOOK",
		"downloadIt": "DOWNLOAD IT",
		"seeInGithub": "See in GitHub",
		"moreInfo": "More Info",
		"developed": "Developed by",
		"powered": "Powered by",

		"welcome": "Welcome, I'm Enrique Ramos Diaz",

		"introduction": "Passionate for machine learning.<br/> I trust that in the near future the artificial intelligence will be the core of all the world's production systems in every known scope.<br/> Learning, discovering new technologies and different ways to do the same thing is what makes for me the computer systems such<br/> an interesting, valuable and exciting field.<br/> Strongly believer that the natural skill is fine, but hard working and persistence to improve is better.<br/> If you want something to be done good, do it by yourself.<br/> Love the music, the sports, the art and the cinema.",

		"header": "<b>Software Developer</b><br/>Bachelor of Science in Computers Systems Engineering graduated at ESCOM - IPN<br/>Technician Degree in Computation graduated at CECyT No. 8 - IPN<br/>"
	},
	"ESP": {
		"aboutMe": "Sobre mí",
		"projects": "Proyectos",
		"resume": "Curriculum Vitae",
		"resumeFile": "./cv/cv.pdf",
		"takeALook": "DAR VISTAZO",
		"downloadIt": "DESCARGAR",
		"seeInGithub": "Ver en GitHub",
		"moreInfo": "Más Info",
		"developed": "Desarrollado por",
		"powered": "Creado con",

		"welcome": "Bienvenido, soy Enrique Ramos Diaz",

		"introduction": "Apasionado por el machine learning.<br/> Conf&iacute;o que en un futuro cercano la inteligencia artificial ser&aacute; el n&uacute;cleo de todos los sistemas de producci&oacute;n en el mundo.<br/>Aprender, descubrir nuevas tecnolog&iacute;as y diferentes formas de hacer una misma cosa es lo que hace para m&iacute; el campo de<br/> sistemas computacionales tan interesante, importante y emocionante.<br/> Fuerte creyente de que el talento natural esta bien, pero el trabajo duro y la perseverancia es mejor.<br/> Si quieres que algo este bien hecho, hazlo t&uacute; mismo.<br/>Amo la m&uacute;sica, los deportes, el arte y el cine.",
	
		"header": "<b>Software Developer</b><br/>Ingeniero en Sistemas Computacionales egresado de la ESCOM - IPN<br/>T&eacute;cnico en Computaci&oacute;n egresado del CECyT No. 8 - IPN"
	}
}