{
	"ENG": {
		"aboutMe": "About Me",
		"projects": "Projects",
		"resume": "Resume",
		"resumeFile": "./cv/resume.pdf",
		"takeALook": "TAKE A LOOK",
		"downloadIt": "DOWNLOAD IT",
		"seeInGithub": "See in GitHub",
		"moreInfo": "More Info",
		"developed": "Developed by",
		"powered": "Powered by",

		"welcome": "Welcome, I'm Enrique Ramos",

		"introduction": "I’m a <b>Software Engineer</b> specialized in backend development with <b>5 years of experience</b> working in internal systems from diverse <b>banking, marketing and retail enterprises</b>.<br/><br/>Passionate for <b>learning</b> and understanding how to boost complex and engaging processes from any type, in order to provide to consumers robust, simplified and user-friendly products with the highest standards to analyze, organize and monitor information and data for their business decision makings.<br/><br/>I’m a curious and a <b>proactive</b> person, always looking to improve my hard skills such as <b>problem solving</b>, development with programming languages and technologies, algorithms and requirements analysis, <b>software architecture and infrastructure design</b>, but also other softer ones like <b>teamwork, communication, assertiveness, ethic, leadership and management.</b>",

		"header": "<b>Software Developer</b><br/>Bachelor of Science in Computers Systems Engineering graduated at ESCOM - IPN<br/>Technician Degree in Computation graduated at CECyT No. 8 - IPN<br/>"
	},
	"ESP": {
		"aboutMe": "Sobre mí",
		"projects": "Proyectos",
		"resume": "Curriculum Vitae",
		"resumeFile": "./cv/resume.pdf",
		"takeALook": "DAR VISTAZO",
		"downloadIt": "DESCARGAR",
		"seeInGithub": "Ver en GitHub",
		"moreInfo": "Más Info",
		"developed": "Desarrollado por",
		"powered": "Creado con",

		"welcome": "Bienvenido, soy Enrique Ramos",

		"introduction": "Soy un <b>Ingeniero de Software</b> especializado en desarrollo backend con <b>5 a&ntilde;os de experiencia</b> trabajando en sistemas internos de diversas compa&ntilde;ias <b>bancarias, de marketing y de autoservicio.</b> <br/><br/>Apasionado por <b>aprender</b> y comprender c&oacute;mo impulsar procesos complejos y atractivos de cualquier tipo, con el fin de ofrecer a clientes productos robustos, simplificados e intuitivos para el usuario con los m&aacute;s altos est&aacute;ndares que analicen, organicen y monitoreen informaci&oacute;n y datos para la toma de decisiones empresariales. <br/><br/>Soy una persona curiosa y <b>proactiva</b>, siempre buscando mejorar mis habilidades como la <b>resoluci&oacute;n de problemas</b>, desarrollo con lenguajes de programaci&oacute;n y tecnolog&iacute;as, algoritmos y an&aacute;lisis de requerimientos, <b>arquitecturas de software y dise&ntilde;o de infraestructuras</b>, sin olvidar aquellas otras sociales como <b>trabajo en equipo, comunicaci&oacute;n, asertividad, &eacute;tica, liderazgo y gesti&oacute;n.</b>",
	
		"header": "<b>Desarrollador de Software</b><br/>Ingeniero en Sistemas Computacionales egresado de la ESCOM - IPN<br/>T&eacute;cnico en Computaci&oacute;n egresado del CECyT No. 8 - IPN"
	}
}